"""
7. Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
название, форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
Если фирма получила убытки, в расчет средней прибыли ее не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь
со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджеры контекста.
"""

# не сделано





# from functools import reduce
#
#
# def fibo_gen():
#     factor = 1
#     while True:
#         if factor > 1:
#             yield reduce(lambda x, y: x * y, range(1, factor + 1))
#         else:
#             yield 1
#         factor += 1
#
#
# if __name__ == '__main__':
#     for idx, num in enumerate(fibo_gen(), start=1):
#         print(idx, num)
#         if idx == 15:
#             break
