"""
1. Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные,
выведите на экран.
"""

print('Здравствуйте! Айнар придумал число для Var1 и текст для Var2')
print('Var1=177')
print('Var2="Первая домашняя работа"')

var3 = int(input('Теперь Вы напишите целое число\n'))
var4 = int(input('Ещё раз напишите другое целое число\n'))
var5 = input("Введите какой-нибудь текст\n")
var6 = input("Напишите ещё что-нибудь, мне нравится как Вы пишите\n")
print('Спасибо!')
